Revit 2027 API
FabricationDimensionDefinition.UnitType Property
 Fabrication dimension unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationDimensionUnitType UnitType { get; }
Public ReadOnly Property UnitType As FabricationDimensionUnitType
	Get
public:
property FabricationDimensionUnitType UnitType {
	FabricationDimensionUnitType get ();
}
member UnitType : FabricationDimensionUnitType with get
Property Value
FabricationDimensionUnitType
See Also
Reference
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace